{
  "url": "http://localhost:5001",

  "about": {
    "image": "/static/img/yifang_photo.JPG",
    "name": "Yifang Guo",
    "aboutme": "Hi, I’m Yifang, a Master’s student in Software Design and Development at the University of Galway, with a strong foundation in Python, Java, and cloud technologies. I thrive in fast-paced environments where I can apply my technical skills to solve complex problems."
  },

  "hobbies": [
    { "name": "Hiking",       "img": "/static/img/hobby_imgs/hiking.png"       },
    { "name": "Photography",  "img": "/static/img/hobby_imgs/photography.png"  },
    { "name": "Tennis",        "img": "/static/img/hobby_imgs/tennis.png"        }
  ],

  "education": [
    {
      "university": "University of Galway",
      "major":      "Software Design and Development",
      "degree":     "Master's",
      "location":   "Galway, Ireland",
      "time":       "2023 – 2025"
    },
    {
      "university": "Tiangong University",
      "major":      "Chemical Engineering",
      "degree":     "Bachelor's",
      "location":   "Tianjin, China",
      "time":       "2016 – 2020"
    }
  ],

  "experience": [
    {
      "role":     "Software Engineering Intern",
      "company":  "Millennium (Top Hedge Fund)",
      "duration": "June 2024 – August 2024",
      "details": [
        "Developed AWS parameter store migration tool via Python library Alembic, and utilized CI/CD pipeline to automate migration in various environments. Significantly reducing manual effort when creating parameters in each environment.",
        "Developed Kafka Topics Copy UI with Hangfire framework, to allow developers to copy Kafka topics from one environment to another environment. Optimized workflow efficiency by enabling parallel execution of copy jobs, eliminating the need for sequential job processing and vastly improving overall productivity.",
        "Strengthened financial knowledge through targeted market training and events, gaining a solid foundation in financial principles and industry dynamics."
      ]
    },
    {
      "role":     "Editorial Assistant",
      "company":  "MDPI (Top OA Publisher)",
      "duration": "June 2020 – July 2023",
      "details": [
        "Supported the editorial process by formatting the English scientific manuscript (Word and LaTeX files), verifying that the format meets publishing requirements.",
        "Converted Word or LaTeX files into XML files, guaranteeing that all papers can be displayed on MDPI website free of mistake.",
        "Collaborated with international authors to facilitate the accurate and timely publication of research articles, fostering effective communication channels and ensuring adherence to publication timelines."
      ]
    },
    {
      "role":     "Training Assistant",
      "company":  "MDPI (Top OA Publisher)",
      "duration": "Part Time",
      "details": [
        "Conducted departmental training programs, providing onboarding skill training and advanced skill training to over 80 newcomers.",
        "Designed and delivered experience-sharing training sessions over 10 times for a team of 600+ department members, resulting in a notable improvement in work efficiency.",
        "Worked in Serbia for approximately 6 months, conducted advanced training sessions three times, and provided peer tutoring to over 10 colleagues."
      ]
    }
  ],

  "countries": ["IRL", "CHN", "TUR", "SRB", "GBR"]
}
